// Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)

let arr = [];
for(let i = 20; i <= 30; i += 0.5){
    arr.push(i);
};
console.log(arr.join(' '))

// Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів

let arr1 = [];
for(let i = 10; i <= 100; i += 10){
    arr1.push(i * 40);
};
console.log(arr1.join(' '))

//  Дано ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N

let sq;
let num = 150; // Число N 
for(let i = 1; i <= 100; i++){
    let sq = i * i;
    if(sq < num){
        console.log(i);
    }
};

// Дано ціле число. З'ясувати, чи воно простим (простим називається число, більше ніж 1, які мають інших дільників крім 1 і себе).

var T;
let N = 19;
if (N > 1){
    if(N % 1 === 0 || N % N === 0){
        for(let i = 2;i < N; i += 1){
            var T = N % i
            if(T === 0){
                console.log(`N - не просте число`);
                break;
            };
        };
        if(T != 0){
            console.log(`N - просте число`);
        };
    }
    else{
        console.log(`N - не просте число`);
    };
}
else {
    console.log(`простим називається число, більше ніж 1`);
};
// Дано деяке число. Ваше завдання – визначити, чи можна отримати це число, піднявши число 3 до певного натурального ступеня. 
// (Як приклад, числа 9 та 81 можна отримати цим способом, але 13 – ні.)

let lt = 3; // Натуральне число 
for(let i = 1; i > 0; i ++){
    if(Math.pow(3, i) === lt){
        console.log(`Можна - ${i} ступень`)
        break;
    }
    else if(Math.pow(3, i) > lt){
        console.log('не можна');
        break;
    };
};